{"meta":{"title":"Interference 2024","subtitle":"The 2024 Foreign Interference Attribution Tracker","subsubtitle":"A Project of the Digital Forensic Research Lab (DFRLab) at the Atlantic Council","og_site_name":"Interference Tracker 2024","og_description":"The DFRLab's Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 election.","og_url":"https://interference2024.org/","og_image":"https://d2u5cqyg0ksa9n.cloudfront.net/images/social_card_image.jpg"},"intro":[{"id":"intro","type":"text","paragraphs":["The DFRLab’s Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that tracks allegations of foreign interference or foreign malign influence relevant to the 2024 U.S. presidential election. We map the actors, methods, and impact associated with each campaign. We also independently evaluate the credibility, bias, evidence, transparency of the underlying claim. Explore the data by scrolling through the visualization and table below. Hover over a point to see details about a particular case."]},{"id":"overview","type":"concealed-text","title":"Overview","paragraphs":["FIAT 2024 builds public attribution standards, provides an independent and reliable record of foreign interference claims in the 2024 U.S. presidential election, serves as a resource for stakeholders about the evolving threat, and helps to build resilience against future foreign interference efforts. FIAT 2024 has been created in service of the DFRLab’s <a href=https://dfrlab.org/about/>mission</a> to identify, expose, and explain disinformation and to promote objective fact as the basis for governance worldwide. It expands upon a <a href=https://interference2020.org/>similar dashboard</a> created by the DFRLab to track foreign interference allegations during the 2020 U.S. presidential election.","The FIAT 2024 dataset contains {{NUMBER}} allegations of foreign interference originating from {{NUMBER}} nations. The dataset was last updated on {{DATE}}.","This tool will be regularly updated as further allegations or attributions of foreign interference in the 2024 U.S. presidential election are made public. If you have questions regarding the tool or would like to submit a case for consideration, please <a href=mailto:DFRLab@atlanticcouncil.org>contact the DFRLab</a>."]},{"id":"how-to-use","type":"concealed-text","title":"How To Use This Tool","paragraphs":["FIAT 2024 consists of five elements that work together to tell the complete story of foreign interference allegations in the 2024 U.S. presidential election (some elements may not be viewable on mobile).","<i>Filters</i> enable users to adjust the visibility of cases by Attribution Score, Actor Nation, Platform, Method, Source, Source Category, Campaign, and Attribution Date. Free text search is also supported.","The <i>Case Timeline</i> displays cases as a series of points, arranged chronologically from left to right by Attribution Date. The position and color of each point corresponds to the three most commonly mentioned Actor Nations: Russia, Iran, or China (additional Actor Nations may be found in the “Other” row). The radius of each point corresponds to the case’s estimated severity on the Breakout Scale. The opacity of each point corresponds to the case’s estimated Attribution Score. Finally, cases in which Offline Mobilization occurred are indicated by a border around the corresponding point.","The Discourse Timeline maps the volume of English-language media conversation regarding foreign interference and relating to the most commonly mentioned Actor Nations: Russia, Iran, or China. More information about these structured queries may be found in the Methodology section. The Discourse Timeline consists of two views:","The Discourse Timeline maps the volume of English-language media conversation regarding foreign interference and relating to the most commonly mentioned Actor Nations: Russia, Iran, or China. More information about these structured queries may be found in the Methodology section. The Discourse Timeline consists of two views:","<ul><li><i>X Posts</i> (default) aggregates the number of posts made daily on X (formerly Twitter) about foreign interference by Russia, Iran, or China. This data was generated by querying an API provided by Meltwater, a social media monitoring tool. The DFRLab collected this data from January 1, 2024.</li><li><i>Television News Mentions</i> aggregates the amount of airtime given to discussing foreign interference by Russia, Iran, or China across CNN, Fox News, and MSBC. This data was generated by querying the <a href=https://blog.gdeltproject.org/the-new-television-explorer-launches/>Television Explorer</a> of the GDELT project, with each instance representing a 15-second window of airtime. The DFRLab collected this data from January 1, 2022.</li></ul>","<i>Key Events</i> plots key events in the 2024 U.S. presidential election cycle.","A <i>Case View</i> may be accessed by hovering the cursor over a given case on the <i>Case Timeline</i> or by toggling to select “Cases” in the <i>Data View</i>. This view provides the Source of Attribution, Date of Attribution, the Date(s) of Activity, and a Description of the given case. Users may also see a breakdown of a case’s Attribution Score by its four subsections (Credibility, Objectivity, Evidence, and Transparency); clicking on the question mark on the right-hand corner of this view also expands the full scorecard. Platforms, Methods, Source, Source Category, and Campaign are also presented in this view and can be clicked to filter the data accordingly.","The <i>Data View</i> presents a simplified table of the FIAT 2024 dataset. Cases are affected by all applied filters and can be sorted according to each column. The <a href=https://fiat-2024-processed-data.s3.us-west-2.amazonaws.com/dfrlab-fiat-2024-dataset.csv >full dataset</a> can also be downloaded from this view. By toggling from “Table” to “Cases,” users may access the <i>Case View</i> of any case in the currently filtered data."]}],"moreInfo":[{"id":"methodology","type":"concealed-text","title":"Methodology","paragraphs":["<i>Case Selection</i>","In order to be included, cases must meet three criteria.","<b>First, cases must involve allegations of foreign interference or foreign malign influence by primarily digital means.</b> The Australian Government Department of Home Affairs <a href=https://www.homeaffairs.gov.au/about-us/our-portfolios/national-security/countering-foreign-interference>defines</a> foreign interference as an activity that is “coercive, corrupting, deceptive, or clandestine” in nature. The U.S. Office of the Director of National Intelligence <a href=https://www.odni.gov/files/FMIC/documents/products/04-25-24_Report_FMI-Primer-Public-Release.pdf>defines</a> foreign malign influence as “subversive, undeclared, coercive, or criminal activities” undertaken to affect another nation’s political attitudes, perceptions, or behaviors. These definitions exclude more benign examples of foreign influence, like lobbying, as well as overt and declared foreign propaganda activities.","<b>Second, cases must be novel.</b> A novel case is one which involves a fresh foreign interference claim or which reveals new evidence to reinvigorate an old one. A novel case is also one in which significant newsworthiness is attached to the individual or organization making the claim. In general, a president or ex-president’s claim is novel regardless of the evidence presented. Meanwhile, an op-ed or report by a mid-level US official is only novel if it contains previously undisclosed information.","<b>Third, cases must be relevant to the 2024 U.S. election.</b> Cases should include allegations of activity intended to influence voting behaviors, denigrate particular candidates, or engage in political or social debates of direct relevance to the election. Cases should also have been recorded after the November 8, 2022 U.S. midterm elections.undisclosed information.","<i>Attribution Score</i>","The Attribution Score is a framework of eighteen binary statements (true or false) that assess foreign interference claims made by governments, technology companies, the media, and civil society organizations. The measure is intended to capture the reliability of the attribution as discernible through public sources rather than to serve as a fact-check of the attribution itself. If a statement is deemed applicable, a point is awarded. If a statement is deemed inapplicable or irrelevant, no point is awarded. Each case was coded twice and reconciled by a third reviewer.","This scoring system is based on the experience of DFRLab experts in assessing—and making—such attributions. It is also based on a review of work produced by the wider disinformation studies community, and particularly resources compiled by <a href=https://attribution.news/>attribution.news</a>.","The Attribution Score is composed of four subsections:","<i>Credibility</i>","<ul><li>The source of the attribution does not have a direct financial interest in a certain attribution outcome.</li><li>The source of the attribution has a diversified and transparent funding stream.</li><li>The source of the attribution does not strongly endorse a specific political ideology.</li><li>The source of the attribution is in no way affiliated with a political campaign.</li><li>The source of the attribution has not previously promoted mis- or disinformation.</li></ul>","<i>Objectivity</i>","<ul><li>The attribution avoids using biased wording. The attribution avoids high-inference or emotive language.</li><li>The headline accurately conveys the content of the attribution.</li><li>The attribution clearly distinguishes factual information from argumentative analysis.</li></ul>","Evidence","<ul><li>The attribution provides a clear illustration of the methods, tactics, and platforms involved in the alleged information operation.</li><li>The attribution contextualizes the engagement with, and impact of, the alleged information operation.</li><li>The attribution identifies actors and states allegedly responsible.</li><li>The attribution clearly explains the strategic goal and rationale of the actors who conducted the alleged information operation.</li><li>The attribution relies on information which is unique to, or can only be procured by, the relevant actor. (e.g. classified information for US federal agencies, back-end/developer information for technology companies)</li></ul>","<i>Transparency</i>","<ul><li>The attribution provides open access to a dataset or archived links of alleged assets.","The Breakout Scale","<a href=https://www.brookings.edu/wp-content/uploads/2020/09/Nimmo_influence_operations_PDF.pdf>The Breakout Scale</a> is a comparative model for estimating the reach and potential impact of influence operations based on data that is “observable, replicable, verifiable, and available from the moment they were posted.” The model was developed by <a href=https://time.com/7017478/ben-nimmo-democracy-defenders/>Ben Nimmo</a>, former DFRLab Research Director.","The Breakout Scale: Measuring The Impact of Influence Operations</a>, categorizes each case’s reach and potential impact based on its spread across platforms, communities, and media types.","The Breakout Scale is divided into six categories:","<ul><li>Category One: The case is confined to one platform with no breakout (i.e. the messaging does not spread beyond the community at the insertion point). </li><li>Category Two: The case is confined to one platform but there is breakout OR is on many platforms with no breakout (insertion points on multiple platforms, but messaging does not spread beyond them). </li><li>Category Three: The case has insertion points and breakout moments on multiple platforms, but it does not spread onto mainstream media. </li><li>Category Four: The case features cross-medium breakout beyond social media. It is reported by mainstream media as embedded posts or as reports. </li><li>Category Five: Celebrity amplification or endorsement.","Attributions lacking sufficient evidence to justify a Breakout Scale classification are scored as “Not Applicable.” These claims only refer to foreign interference in general terms and do not describe any specific operations.","Discourse Timeline","The Discourse Timeline displays X data captured via Meltwater and television airtime data captured via GDELT. In both cases, we used a structured search consisting of an “Interference Term” and a “Country Term,” outlined in the table below. In the case of Meltwater, we also used the search term in “Platform and Post Type Filters” to limit results to the X platform. The GDELT query differs slightly to accommodate the absence of  wildcard character support.","<table class=table is-striped> <thead> <tr> <th>Interference Term</th> <th>Country Term</th> <th>Platform and Post Type Filters</th> </tr> </thead> <tbody> <tr> <td rowspan=3> (amplif* OR bot OR bots OR collu* OR conspir* OR disinfo* OR disseminat* OR fake* OR financ* OR foreign OR fraud* OR fund* OR implicat* OR inauthentic OR influenc* OR intelligence OR interfer* OR malign OR manipulat* OR meddl* OR money OR narrative* OR polariz* OR promot* OR propagand* OR psyop* OR sponsor* OR tamper* OR undermin*) AND </td> <td> (Iran OR Iranian OR Khamenei) </td> <td rowspan=3> AND (NOT postType:rp) AND (socialType:twitter) </td> </tr> <tr> <td>(Kremlin OR Putin OR Russia OR Russian)</td> </tr> <tr> <td>(Beijing OR China OR Chinese OR Xi OR Xi Jinping)</td> </tr> </tbody> </table>"]},{"id":"taxonomy","type":"concealed-text","title":"Taxonomy: Terminology & Codebook","paragraphs":["Allegations of foreign interference in US elections that met the case selection criteria were recorded by DFRLab coders using a codebook of variables. Seven text variables, 52 multi-variable options, and four other variables were used to describe who made the allegation of interference against who, what the attribution was, when it occurred, the platforms where it occurred, and how the interference was conducted. Some cases contain multiple allegations either referring to interference attempts by different nation-states or specific actors/campaigns originating from a single nation. To accommodate these cases, five additional variables are included to describe each “sub-attribution” in a given case.","<h5>What was the attribution?</h5> <ul> <li><strong>Short Title</strong> (free text).</li> <li><strong>Short Description</strong> (free text).</li> <li><strong>Link to Attribution</strong> (link).</li> </ul> <h5>When did the interference and attribution occur?</h5> <ul> <li><strong>Date(s) of Activity.</strong> Date or range of purported activity.</li> <ul class=inner> <li><strong>Start</strong> (date). Input if start date is known; if not, omit.</li> <li><strong>End</strong> (date). Input if end date is known, if not, omit.</li> <li><strong>Date of Attribution</strong> (date). Date corresponds to date of link of attribution.</li> </ul> </ul> <h5>Who is making the attribution, against whom?</h5> <ul> <li><strong>Source of Allegation</strong> (free text). The original source of the interference allegation.</li> <li><strong>Source Nation</strong> (free text). The country where the source of the interference allegation originates. Since the scope of this dataset is interference in the US, the most common source nation for allegations is the United States. The source nation does not necessarily denote the actor was associated with a national government.</li> <li> <strong>Source Category</strong> (select all that apply). <ul class=inner> <li><strong>Civil Society Organization.</strong> A nonprofit, non-governmental, non-media entity, typically a university or think tank.</li> <li><strong>Foreign Government Body.</strong> A non-US government entity.</li> <li><strong>Government.</strong> Government agencies, elected representatives, and officials, even if quoted anonymously.</li> <li><strong>Influential Individual.</strong> A noteworthy individual, not currently affiliated with another category, who is deemed nationally recognizable or operating in the public sphere.</li> <li><strong>Media.</strong> Only applies if a news organization makes the allegation on the basis of its own investigation. A media organization reporting on an allegation made by someone else (e.g. an anonymous government official) is not included.</li> <li><strong>Private Consultancy.</strong> A company engaged in private monitoring and risk consulting, typically in the field of cybersecurity.</li> <li><strong>Technology Company.</strong> A company that operates a social media platform or offers a technology service.</li> </ul> </li> <li><strong>Actor</strong> (free text). Brief description of the actor purportedly responsible for the interference attempt.</li> <li><strong>Actor Nation</strong> (free text). The country where the interference originates, according to the source. When an allegation comes from a non-state political actor, this field is the nation of origin of that non-state political actor. This does not necessarily denote an actor is associated with the national government.</li> <li> <strong>Attribution Type</strong> (select all that apply). <ul class=inner> <li><strong>Direct Attribution.</strong> The source directly accuses the actor of malicious political behavior.</li> <li><strong>Proxy/Inferred Attribution.</strong> The source does not make a direct attribution, but clearly states that the activity is likely associated with the actor or strongly implies the accusation is directed at the actor.</li> <li><strong>Non-Aligned Commercial Activity.</strong> The interference consists of malicious commercial activity rather than a politically motivated information operation.</li> </ul> </li> <li><strong>Campaign</strong> (free text). An identifying tag used to relate attributions to one another which revolve around the same emergent narratives, tactics, or subjects. Discrete tags indicating the activities were part of a larger pattern of behavior or a concerted effort.</li> </ul> <h5>On what platforms did the interference purportedly take place?</h5> <ul> <li> <strong>Media</strong> (select all that apply). <ul class=inner> <li><strong>State Media.</strong> A media outlet controlled by a government or government proxy, which is not editorially independent.</li> <li><strong>Independent Media.</strong> Media outlets that are generally regarded as reputable, balanced, and independent of direct government control.</li> <li><strong>\"Junk News\" Media.</strong> Unreliable, skewed, openly propagandistic, or fringe media outlets that lack discernable government ties.</li> </ul> </li> <li> <strong>Platform</strong> (select all that apply). Platform(s) on which alleged interference occurred. <ul class=inner> <li>Facebook</li> <li>Instagram</li> <li>X</li> <li>YouTube</li> <li>LinkedIn</li> <li>Reddit</li> <li>Discord</li> <li>VK</li> <li>Forum Board</li> <li>WhatsApp</li> <li>Telegram</li> <li>Signal</li> <li>WeChat</li> <li>SMS</li> <li>TikTok</li> <li>Unspecified</li> <li>Other (free text)</li> </ul> </li> <li><strong>Other Platforms</strong> (select all that apply).</li> <ul class=inner> <li><strong>Advertisement</strong> (binary).</li> <li><strong>Email</strong> (binary).</li> </ul> </ul> <h5>How was the interference purportedly conducted?</h5> <ul> <li> <strong>Method</strong> (select all that apply). Methods used in both the creation and the amplification of content related to the alleged foreign interference. <ul class=inner> <li><strong>Brigading.</strong> Authentic social media accounts but evidence of coordinated amplification or harassment.</li> <li><strong>Sockpuppets.</strong> Inauthentic social media accounts; evidence suggests a high likelihood of human operation.</li> <li><strong>Third-Party Automation.</strong> Inauthentic social media accounts; evidence suggests a high likelihood of automation by third-party program.</li> <li><strong>DDoS.</strong> Distributed denial-of-service attack; malicious attempt to disrupt server traffic.</li> <li><strong>Domain Spoofing.</strong> Manipulation of search queries and results; typosquatting.</li> <li><strong>Influencer Payola.</strong> Clandestine or indirect payment to an organization or influential individual for the purposes of content creation or amplification.</li> <li> <strong>Hacking</strong> (select all that apply). Unauthorized and clandestine access to or manipulation of digital systems, networks, or data, often for the purpose of information gathering, system disruption, or data manipulation. <ul class=inner-square> <li><strong>Data Manipulation.</strong> The clandestine manipulation of computer systems or accounts; Account hijacking or the cooptation of users' social media profiles.</li> <li><strong>Data Exfiltration.</strong> Unauthorized movement of data; spearphishing; hack-and-release.</li> <li><strong>Other.</strong> Forms of hacking not captured by the categories above.</li> </ul> </li> <li><strong>Cheapfakes.</strong> Deceptively edited content; decontextualization of existing media, passed off as current; deceptive co-option of existing brands; does not include use of Generative AI.</li> <li><strong>Generative AI.</strong> Augmented or fabricated content produced using artificial intelligence; \"deep fakes\"; textual generation. Sometimes referred to as \"<a href=https://securingdemocracy.gmfus.org/deepfake-myths-common-misconceptions-about-synthetic-media/>synthetic media</a>,\" although this term does not adequately distinguish between the use of deep learning and use of more basic manipulative techniques. </ul> </li> </ul> <h5>How far did the interference effort spread?</h5> <ul> <li> <strong>Breakout Scale</strong> (binary, select one). Methodology is described above; Categorize the influence operation's reach and potential impact based on its spread across platforms, communities, and media types. <ul class=inner> <li>Category One</li> <li>Category Two</li> <li>Category Three</li> <li>Category Four</li> <li>Category Five</li> <li>Category Six</li> <li>Not Applicable (Allegation is too vague to categorize)</li> </ul> </li> <li><strong>Offline Mobilization</strong> (binary). Tangible, real-world events and activities ascribed to the influence operation.</li> </ul> <h5>How credible, biased, legitimate, and transparent is the allegation?</h5> <ul> <li> <strong>Attribution Score.</strong> Methodology is described above; the goal of this score is to critically assess the validity of the allegation from multiple perspectives. <ul class=inner> <li>Credibility</li> <li>Bias</li> <li>Evidence</li> <li>Transparency</li> </ul> </li> </ul> <h5>For each sub-attribution in a given case, the following data is included:</h5> <h5>Who, specifically, carried out the interference?</h5> <ul> <li><strong>Sub-Actor</strong> (free text). Expressly named Actor included in the primary attribution to whom specific activities are linked.</li> <li><strong>Sub-Actor Nation</strong> (free text). National affiliation of the named sub-actor.</li> <li><strong>Sub-Actor Parent Organization or Affiliation</strong> (free text). The organization, institution, or affiliation within which the sub-actor operates. This does not include Actor Nation. (Examples would include IRGC, 8200, CENTCOM, Ministry of Public Security.)</li> <li><strong>Campaign Tag</strong> (free text). Does this sub-attribution connect to any larger pattern of behavior? See the existing list of \"Campaign\" Tags before making a new tag.</li> <li><strong>Date of Activity</strong> (free text). Date or range of purported activity.</li> </ul>"]},{"id":"about","type":"text","title":"About This Project","paragraphs":["The core FIAT research team is composed of Max Rizzuto, Dina Sadek, Meredith Furbish, Julien Fagel, and Emerson T. Brooking.","The tool was developed by <a href=https://www.maartenlambrechts.com/>Maarten Lambrechts</a>, based on the Interference 2020 Tracker developed by <a href=https://higsch.com/>Mathias Stahl</a>.","This project was directed by Graham Brookie and Emerson T. Brooking and edited by Andy Carvin.","Invaluable counsel and coordination was provided by Nicholas Yap, Andy Carvin, Dominique Ramsawak, and Heather Kunin."]},{"id":"about-dfrlab","type":"text","title":"About The DFRLab","paragraphs":["The Digital Forensic Research Lab (DFRLab) at the Atlantic Council is a first of its kind organization with technical and policy expertise on disinformation, connective technologies, democracy, and the future of digital rights. Incubated at the Atlantic Council in 2016, the DFRLab is a field-builder, studying, defining, and informing approaches to the global information ecosystem and the technology that underpins it.","The DFRLab pursues this mission through three main efforts:","<ul><li>Producing timely primary open source (OSINT) research on disinformation, online harms, foreign interference, platform policy and approaches, and other aspects of the information ecosystem globally;</li><li>Setting research standards and training others around the world in techniques and practices, enabling more people to do work like the DFRLab in their own backyards, or to mainstream an understanding of the digital ecosystem into their fields; and </li><li>Leveraging the DFRLab’s unique insights from work across governments, companies, media, and civil society to craft policy recommendations, and collaborate with the global community working to ensure the digital world is a rights-reinforcing and democratic one</li></ul>"]},{"id":"about-atlantic-council","type":"text","title":"About the Atlantic Council","paragraphs":["The Atlantic Council promotes constructive leadership and engagement in international affairs based on the Atlantic Community’s central role in meeting global challenges. The Council provides an essential forum for navigating the dramatic economic and political changes defining the twenty-first century by informing and galvanizing its uniquely influential network of global leaders. The Atlantic Council—through the papers it publishes, the ideas it generates, the future leaders it develops, and the communities it builds—shapes policy choices and strategies to create a more free, secure, and prosperous world."]}]}