{"meta":{"title":"Interference 2024","subtitle":"Foreign Interference Attribution Tracker","subsubtitle":"A Project of the Digital Forensic Research Lab (DFRLab) at the Atlantic Council","og_site_name":"Interference Tracker 2024","og_description":"The DFRLab's Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 election.","og_url":"https://interference2024.org/","og_image":""},"intro":[{"id":"intro","type":"text","paragraphs":["The DFRLab’s 2024 Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 US general election. This tool assesses the credibility, bias, evidence, transparency, and impact of each claim. Explore by scrolling through the visualization and table below. Hover over a point to see details about a particular case."]},{"id":"overview","type":"concealed-text","title":"Overview","paragraphs":["The FIAT 2024 dataset contains {{NUMBER}} allegations of foreign interference originating from {{NUMBER}} nations. Stories regarding these claims have received a cumulative {{NUMBER}} social media shares and engagements. The dataset was last updated on {{DATE}}.","This tool will be regularly updated through November 2024 as further allegations or attributions of foreign interference in the 2024 US election are made public. If you have questions regarding the tool or would like to submit a case for consideration, please contact the DFRLab. <a href=mailto:DFRLab@atlanticcouncil.org>contact the DFRLab</a>."]},{"id":"how-to-use","type":"concealed-text","title":"How To Use This Tool","paragraphs":["FIAT 2024 consists of six elements that work together to tell the complete story of foreign interference allegations in the 2024 US. elections.","<i>Filters</i> enable users to adjust the visibility of cases by Attribution Score, Actor Nation, Platform, Method, Source, Source Category, Campaign, and Date. Free text search is also supported.","<i>Metrics View</i> represents the amount of public discourse around interference allegations by aggregating the number of posts made daily on X (formerly Twitter) discussing interference by the most prevalent national actors: Russia, China, and Iran. This data was generated by querying an API provided by Meltwater, a social media monitoring tool, for X posts containing both an interference term and a country term. Detailed in the table below, each query consists of a standardized list of interference terms, a list of relevant country terms based on the name of the country or its leadership, and filters for social media platform and post type. DFRLab collected this data from January 1, 2022 through the end of November 2024.","<i>Case Tooltips</i> are accessible by hovering over a given case. This enables users to see the Attribution Type, Date of Attribution, the Date(s) of Activity, and a Description of a given case. Users can also see a breakdown of a case’s Attribution Score by its four subsections (Credibility, Objectivity, Evidence, and Transparency); clicking on the question mark on the right-hand corner of this view also expands the full scorecard. Platforms, Methods, Source, Source Category, Campaign, and Link to an Attribution are also presented in the tooltip and can be clicked to filter the Case View accordingly. A link within each tooltip brings users to the table row in the Dataset View for the selected case.","<i>Dataset View</i> presents a simplified spreadsheet view of the FIAT 2024 dataset. Cases are affected by all applied filters and can be sorted according to each column. The full dataset can also be downloaded from this view.","<i>Cards View</i> presents cases as a card deck complete with related images. Cases are affected by all applied filters and can be sorted according to each variable using the dropdown menu."]}],"moreInfo":[{"id":"methodology","type":"concealed-text","title":"Methodology","paragraphs":["<i>Case Selection</i>","In defining and differentiating cases, the DFRLab established three criteria.","Second, cases must be novel. A novel case is one which involves a fresh foreign interference claim or which reveals new evidence to reinvigorate an old one. A novel case is also one in which significant newsworthiness is attached to the individual or organization making the claim. In general, a president or ex-president’s claim is novel regardless of the evidence presented. Meanwhile, an op-ed or report by a mid-level US official is only novel if it contains previously undisclosed information.","Third and finally, cases must be relevant to the 2024 US election. This focuses case selection on alleged foreign interference that seems intended to influence voting behaviors, denigrate particular candidates, or engage in political or social issues of direct relevance to the election. It also bounds case selection to foreign interference claims that occurred around or following the 2022 US midterm elections through November 2024.","<i>Attribution Score</i>","The Attribution Score is a framework of eighteen binary statements (true or false) that assess foreign interference claims made by governments, technology companies, the media, and civil society organizations. The measure is intended to capture the reliability of the attribution as discernible through public sources rather than to serve as a fact-check of the attribution itself. If a statement is deemed applicable, a point is awarded. If a statement is deemed inapplicable or irrelevant, no point is awarded. Initial coding was reviewed by the FIAT research team and shaped by iterative discussion.","This scoring system is based on the experience of DFRLab experts in assessing—and making—such allegations. It is also based on a review of work produced by the wider disinformation studies community, and particularly resources compiled by <a href=\"https://attribution.news/\">attribution.news</a>."]},{"id":"case-selection","type":"concealed-text","title":"Case Selection","paragraphs":["Blah Blah Blah case selection content."]},{"id":"about","type":"text","label":"About This Project","paragraphs":["Blah Blah Blah"]},{"id":"about-dfrlab","type":"text","title":"About The DFRLab","paragraphs":["Blah Blah BLah"]}]}