{"meta":{"title":"Interference 2024","subtitle":"The 2024 Foreign Interference Attribution Tracker","subsubtitle":"A Project of the Digital Forensic Research Lab (DFRLab) at the Atlantic Council","og_site_name":"Interference Tracker 2024","og_description":"The DFRLab's Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 election.","og_url":"https://interference2024.org/","og_image":""},"intro":[{"id":"intro","type":"text","paragraphs":["The DFRLab’s 2024 Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign influence or interference relevant to the 2024 US general election. This is a continuation of DFRLab’s work in creating a record of malign foreign influence focused on US elections, including <a href=\"https://interference2020.org/\">a similar record and interface in 2020</a>. The tool assesses the credibility, bias, evidence, transparency, and impact of each claim. Explore by scrolling through the visualization and table below. Hover over a point to see details about a particular case."]},{"id":"overview","type":"concealed-text","title":"Overview","paragraphs":["FIAT 2024 builds public attribution standards, provides an independent and reliable record of foreign interference in the 2024 election, serves as a resource for stakeholders about the evolving threat, and helps to build public resilience against future foreign interference efforts and disinformation. It builds on the foundations of the FIAT dashboard created for the 2020 presidential elections, and it has been created in service of the <a href=” https://www.atlanticcouncil.org/programs/digital-forensic-research-lab/”> DFRLab’s</a> mission to identify, expose, and explain disinformation and to promote objective fact as the basis for governance worldwide.","The FIAT 2024 dataset contains {{NUMBER}} allegations of foreign interference originating from {{NUMBER}} nations. Stories regarding these claims have received a cumulative {{NUMBER}} social media shares and engagements. The dataset was last updated on {{DATE }}.","This tool will be regularly updated through November 2024 as further allegations or attributions of foreign interference in the 2024 US election are made public. If you have questions regarding the tool or would like to submit a case for consideration, please <a href=mailto:DFRLab@atlanticcouncil.org>contact the DFRLab</a>."]},{"id":"how-to-use","type":"concealed-text","title":"How To Use This Tool","paragraphs":["FIAT 2024 consists of six elements that work together to tell the complete story of foreign interference allegations in the 2024 US elections.","<i>Filters</i> enable users to adjust the visibility of cases by Attribution Score, Actor Nation, Platform, Method, Source, Source Category, Campaign, and Date. Free text search is also supported.","<i>Case View</i> displays cases as a series of points, arranged chronologically from left to right by Attribution Date. The color of each point corresponds to Actor Nation, while its size corresponds to Breakout Scale, with “Not Applicable” being smallest and “Category 6” - largest. Point opacity corresponds to Attribution scores, where cases with higher scores are more opaque. Finally, cases in which Offline Mobilization occurred are indicated by a border around the corresponding point. The bottom row of the visualization provides additional context by plotting key events in the election cycle, including televised debates and assassination attempts on former President Trump.","<i>Metrics View</i> represents the amount of public discourse around interference allegations by aggregating the number of posts made daily on X (formerly Twitter) discussing interference by the most prevalent national actors: Russia, China, and Iran. This data was generated by querying an API provided by Meltwater, a social media monitoring tool, for X posts containing both an interference term and a country term. Detailed in the table below, each query consists of a standardized list of interference terms, a list of relevant country terms based on the name of the country or its leadership, and filters for social media platform and post type. DFRLab collected this data from January 1, 2024 through the end of November 2024.","<table class=\"table is-striped\"> <thead> <tr> <th>Interference Term</th> <th>Country Term</th> <th>Platform and Post Type Filters</th> </tr> </thead> <tbody> <tr> <td rowspan=\"3\"> (amplif* OR bot OR bots OR collu* OR conspir* OR disinfo* OR disseminat* OR fake* OR financ* OR foreign OR fraud* OR fund* OR implicat* OR inauthentic OR influenc* OR intelligence OR interfer* OR malign OR manipulat* OR meddl* OR money OR narrative* OR polariz* OR promot* OR propagand* OR psyop* OR sponsor* OR tamper* OR undermin*) AND </td> <td> (Iran OR Iranian OR Khamenei) </td> <td rowspan=\"3\"> AND (NOT postType:rp) AND (socialType:twitter) </td> </tr> <tr> <td>(Kremlin OR Putin OR Russia OR Russian)</td> </tr> <tr> <td>(Beijing OR China OR Chinese OR Xi OR Xi Jinping)</td> </tr> </tbody> </table>","Metrics from the platform X (via Meltwater) is displayed interchangeably with the volume of foreign interference related language broadcast by US mainstream TV news media. This data is provided by the GDELT Project, which tracks and indexes international news media. The DFRLab queried the data using the same terms used for Meltwater, the combination of an interference term and a country term, and combined the total volume of mentions across CNN, Fox News, and MSNBC. The DFRLab collected this data from January 1, 2022 through the end of November 2024.","<i>Case Tooltips</i> are accessible by hovering over a given case. This enables users to see the Attribution Type, Date of Attribution, the Date(s) of Activity, and a Description of a given case. Users can also see a breakdown of a case’s Attribution Score by its four subsections (Credibility, Objectivity, Evidence, and Transparency); clicking on the question mark on the right-hand corner of this view also expands the full scorecard. Platforms, Methods, Source, Source Category, Campaign, and Link to an Attribution are also presented in the tooltip and can be clicked to filter the Case View accordingly. A link within each tooltip brings users to the table row in the Dataset View for the selected case.","<i>Dataset View</i> presents a simplified spreadsheet view of the FIAT 2024 dataset. Cases are affected by all applied filters and can be sorted according to each column. The <a href=”https://fiat-2024-processed-data.s3.us-west-2.amazonaws.com/dfrlab-fiat-2024-dataset.csv “>full dataset </a>can also be downloaded from this view.","<i>Cards View</i> presents cases as a card deck complete with related images. Cases are affected by all applied filters and can be sorted according to each variable using the dropdown menu."]}],"moreInfo":[{"id":"methodology","type":"concealed-text","title":"Methodology","paragraphs":["<i>Case Selection</i>","In defining and differentiating cases, the DFRLab established three criteria.","First, cases must involve allegations of foreign interference or foreign malign influence by primarily digital means. The Australian Government Department of Home Affairs defines foreign interference as activity by a foreign actor that is “coercive, corrupting, deceptive, or clandestine” in nature, distinguishing it from the more benign phenomenon of foreign influence. Likewise, the US Office of the Director of National Intelligence defines foreign malign influence as “subversive, undeclared, coercive, or criminal activities by foreign governments, non-state actors, or their proxies to affect another nation’s popular or political attitudes, perceptions, or behaviors to advance their interests”. By focusing expressly on digital activity, this definition denotes a range of interference activities—including disinformation, media manipulation, and cyber intrusion—that are conducted by foreign actors to affect political outcomes. It excludes overt adversarial foreign propaganda, such as that from RT or Xinhua.","Second, cases must be novel. A novel case is one which involves a fresh foreign interference claim or which reveals new evidence to reinvigorate an old one. A novel case is also one in which significant newsworthiness is attached to the individual or organization making the claim. In general, a president or ex-president’s claim is novel regardless of the evidence presented. Meanwhile, an op-ed or report by a mid-level US official is only novel if it contains previously undisclosed information.","Second, cases must be novel. A novel case is one which involves a fresh foreign interference claim or which reveals new evidence to reinvigorate an old one. A novel case is also one in which significant newsworthiness is attached to the individual or organization making the claim. In general, a president or ex-president’s claim is novel regardless of the evidence presented. Meanwhile, an op-ed or report by a mid-level US official is only novel if it contains previously undisclosed information.","<i>Attribution Score</i>","The Attribution Score is a framework of eighteen binary statements (true or false) that assess foreign interference claims made by governments, technology companies, the media, and civil society organizations. The measure is intended to capture the reliability of the attribution as discernible through public sources rather than to serve as a fact-check of the attribution itself. If a statement is deemed applicable, a point is awarded. If a statement is deemed inapplicable or irrelevant, no point is awarded. Initial coding was reviewed by the FIAT research team and shaped by iterative discussion.","The Attribution Score is composed of four subsections:","<i>Credibility</i>","<ul><li>The source of the attribution does not have a direct financial interest in a certain attribution outcome.</li><li>The source of the attribution has a diversified and transparent funding stream.</li><li>The source of the attribution does not strongly endorse a specific political ideology.</li><li>The source of the attribution is in no way affiliated with a political campaign.</li><li>The source of the attribution has not previously promoted mis- or disinformation.</li></ul>","<i>Objectivity</i>","<ul><li>The attribution avoids using biased wording. The attribution avoids high-inference or emotive language.</li><li>The headline accurately conveys the content of the attribution.</li><li>The attribution clearly distinguishes factual information from argumentative analysis.</li></ul>","Evidence","<ul><li>The attribution provides a clear illustration of the methods, tactics, and platforms involved in the alleged information operation.</li><li>The attribution contextualizes the engagement with, and impact of, the alleged information operation.</li><li>The attribution identifies actors and states allegedly responsible.</li><li>The attribution clearly explains the strategic goal and rationale of the actors who conducted the alleged information operation.</li><li>The attribution relies on information which is unique to, or can only be procured by, the relevant actor. (e.g. classified information for US federal agencies, back-end/developer information for technology companies)</li></ul>","<i>Transparency</i>","<ul><li>The attribution provides open access to a dataset or archived links of alleged assets.","The Breakout Scale","The Breakout Scale, a comparative model designed by DFRLab alumni Ben Nimmo in his 2020 report <a href=https://www.brookings.edu/wp-content/uploads/2020/09/Nimmo_influence_operations_PDF.pdf>The Breakout Scale: Measuring The Impact of Influence Operations</a>, categorizes each case’s reach and potential impact based on its spread across platforms, communities, and media types.","The Breakout Scale is comprised of 6 categories:","<ul><li>Category One: The case is confined to one platform with no breakout (i.e. the messaging does not spread beyond the community at the insertion point). </li><li>Category Two: The case is confined to one platform but there is breakout OR is on many platforms with no breakout (insertion points on multiple platforms, but messaging does not spread beyond them). </li><li>Category Three: The case has insertion points and breakout moments on multiple platforms, but it does not spread onto mainstream media. </li><li>Category Four: The case features cross-medium breakout beyond social media. It is reported by mainstream media as embedded posts or as reports. </li><li>Category Five: Celebrity amplification or endorsement.","Attributions lacking sufficient evidence to justify a Breakout Scale classification are scored as “Not Applicable.” Such allegations only refer to interference in general terms and do not describe any specific operations."]},{"id":"taxonomy","type":"concealed-text","title":"Taxonomy: Terminology & Codebook","paragraphs":["Allegations of foreign interference in US elections that met the case selection criteria were recorded by DFRLab coders using a codebook of variables. Seven text variables, 52 multi-variable options, and four other variables were used to describe who made the allegation of interference against who, what the attribution was, when it occurred, the platforms where it occurred, and how the interference was conducted. Some cases contain multiple allegations either referring to interference attempts by different nation-states or specific actors/campaigns originating from a single nation. To accommodate these cases, five additional variables are included to describe each “sub attribution” in a given attribution."]},{"id":"about","type":"text","title":"About This Project","paragraphs":["The core FIAT research team is composed of Max Rizzuto, Dina Sadek, Meredith Furbish, Julien Fagel, and Emerson T. Brooking.","The tool was developed by <a href=\"https://www.maartenlambrechts.com/\">Maarten Lambrechts</a>, based on the Interference 2020 Tracker developed by <a href=\"https://higsch.com/\">Mathias Stahl</a>.","This project was directed by Graham Brookie and Emerson T. Brooking and edited by Andy Carvin.","Invaluable counsel and coordination was provided by Nicholas Yap, Andy Carvin, Dominique Ramsawak, and Heather Kunin."]},{"id":"about-dfrlab","type":"text","title":"About The DFRLab","paragraphs":["The Digital Forensic Research Lab (DFRLab) at the Atlantic Council is a first of its kind organization with technical and policy expertise on disinformation, connective technologies, democracy, and the future of digital rights. Incubated at the Atlantic Council in 2016, the DFRLab is a field-builder, studying, defining, and informing approaches to the global information ecosystem and the technology that underpins it.","The DFRLab pursues this mission through three main efforts:","<ul><li>Producing timely primary open source (OSINT) research on disinformation, online harms, foreign interference, platform policy and approaches, and other aspects of the information ecosystem globally;</li><li>Setting research standards and training others around the world in techniques and practices, enabling more people to do work like the DFRLab in their own backyards, or to mainstream an understanding of the digital ecosystem into their fields; and </li><li>Leveraging the DFRLab’s unique insights from work across governments, companies, media, and civil society to craft policy recommendations, and collaborate with the global community working to ensure the digital world is a rights-reinforcing and democratic one</li></ul>"]},{"id":"about-atlantic-council","type":"text","title":"About the Atlantic Council","paragraphs":["The Atlantic Council promotes constructive leadership and engagement in international affairs based on the Atlantic Community’s central role in meeting global challenges. The Council provides an essential forum for navigating the dramatic economic and political changes defining the twenty-first century by informing and galvanizing its uniquely influential network of global leaders. The Atlantic Council—through the papers it publishes, the ideas it generates, the future leaders it develops, and the communities it builds—shapes policy choices and strategies to create a more free, secure, and prosperous world."]}]}