{"meta":{"title":"Interference Tracker 2024","subtitle":"Foreign Interference Attribution Tracker","og_site_name":"Interference Tracker 2024","og_description":"The DFRLab's Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 election.","og_url":"https://interference2020.org/","og_image":""},"intro":[{"id":"intro","type":"text","text":"The DFRLab's Foreign Interference Attribution Tracker (FIAT) is an interactive, open-source database that captures allegations of foreign interference relevant to the 2024 election. This tool assesses the credibility, bias, evidence, transparency, and impact of each claim. Explore by scrolling through the timeline and cases below. Hover over a circle to see details about a particular case."},{"id":"overview","type":"concealed-text","title":"Overview","text":"This project builds public attribution standards, provides an independent and reliable record of foreign interference in the 2020 election, serves as a resource for stakeholders about the evolving threat, and helps to build public resilience against future foreign interference efforts and disinformation. It has been created in service of the <a href=https://www.atlanticcouncil.org/programs/digital-forensic-research-lab/>DFRLab's</a>) mission to identity, expose, and explain disinformation and to promote objective fact as the basis for governance worldwide. The FIAT dataset contains _NUMBER allegations_ of foreign interference originating from _NUMBER nations_. Stories regarding these claims have received a cumulative _NUMBER social media shares and engagements_. The dataset was last updated on _DATE_. This tool will be regularly updated as further allegations or attributions of foreign interference in the 2024 U.S. election are made public. If you have questions regarding the tool or would like to submit a case for consideration, please <a href=mailto:DFRLab@atlanticcouncil.org>contact the DFRLab</a>."},{"id":"how-to-use","type":"concealed-text","title":"How To Use This Tool","text":"FIAT consists of six elements that work together in order to tell the complete story of foreign interference allegations in the 2024 U.S. elections. _Filters_ enable users to adjust the visibility of cases by Attribution Score, Actor, Nation, Platform, Method, Source, and Source Category. Free text search is also supported."}],"moreInfo":[{"id":"methodology","type":"concealed-text","title":"Methodology","text":"Blah Blah Blah text about methodology."},{"id":"case-selection","type":"concealed-text","title":"Case Selection","text":"Blah Blah Blah case selection content."},{"id":"about","type":"text","label":"About This Project","text":"Blah Blah Blah"},{"id":"about-dfrlab","type":"text","title":"About The DFRLab","text":"Blah Blah BLah"}]}